#### Terraform Plan
```
module.api_lambda.aws_iam_role.lambda: Refreshing state... [id=trip-assistant-api-dev-role]
module.agent_lambda.aws_iam_role.lambda: Refreshing state... [id=trip-assistant-agent-dev-role]
module.api_gateway.aws_apigatewayv2_api.api: Refreshing state... [id=takhous4qh]
module.ecr.aws_ecr_repository.agent: Refreshing state... [id=trip-assistant-agent]
module.ssm.aws_ssm_parameter.openai_api_key: Refreshing state... [id=/trip-assistant/dev/openai-api-key]
module.github_oidc.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::727864369235:oidc-provider/token.actions.githubusercontent.com]
module.s3_cloudfront.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=EZL1GR0AY9GEK]
module.ecr.aws_ecr_repository.api: Refreshing state... [id=trip-assistant-api]
module.s3_cloudfront.aws_s3_bucket.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=us-east-2_JjUEYijkz]
module.github_oidc.aws_iam_role.github_actions: Refreshing state... [id=trip-assistant-github-actions-dev]
module.agent_lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=trip-assistant-agent-dev-role-20260214103246950000000002]
module.api_lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=trip-assistant-api-dev-role-20260214103246950000000001]
module.api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.ecr.aws_ecr_lifecycle_policy.api: Refreshing state... [id=trip-assistant-api]
module.github_oidc.aws_iam_role_policy.terraform: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-terraform-dev]
module.agent_lambda.aws_iam_role_policy.ssm_read: Refreshing state... [id=trip-assistant-agent-dev-role:trip-assistant-agent-dev-ssm]
module.ecr.aws_ecr_lifecycle_policy.agent: Refreshing state... [id=trip-assistant-agent]
module.github_oidc.aws_iam_role_policy.ecr_push: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-ecr-push-dev]
module.agent_lambda.aws_lambda_function.agent: Refreshing state... [id=trip-assistant-agent]
module.cognito.aws_cognito_identity_provider.google: Refreshing state... [id=us-east-2_JjUEYijkz:Google]
module.s3_cloudfront.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.github_oidc.aws_iam_role_policy.frontend_deploy: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-frontend-deploy-dev]
module.s3_cloudfront.aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.s3_cloudfront.aws_cloudfront_distribution.frontend: Refreshing state... [id=E8DTLPIKKKCQ0]
module.agent_lambda.aws_lambda_alias.env: Refreshing state... [id=arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-agent:dev]
module.api_lambda.aws_iam_role_policy.invoke_agent: Refreshing state... [id=trip-assistant-api-dev-role:trip-assistant-api-dev-invoke-agent]
module.agent_lambda.aws_cloudwatch_log_group.agent: Refreshing state... [id=/aws/lambda/trip-assistant-agent]
module.s3_cloudfront.aws_s3_bucket_policy.frontend: Refreshing state... [id=trip-assistant-frontend-dev]
module.cognito.aws_cognito_user_pool_client.frontend: Refreshing state... [id=1qs5jpj6omcg926mg3fdmcsbpv]
module.api_lambda.aws_lambda_function.api: Refreshing state... [id=trip-assistant-api]
module.api_gateway.aws_apigatewayv2_authorizer.cognito: Refreshing state... [id=071ui4]
module.api_lambda.aws_lambda_alias.env: Refreshing state... [id=arn:aws:lambda:us-east-2:727864369235:function:trip-assistant-api:dev]
module.api_lambda.aws_cloudwatch_log_group.api: Refreshing state... [id=/aws/lambda/trip-assistant-api]
module.github_oidc.aws_iam_role_policy.lambda_deploy: Refreshing state... [id=trip-assistant-github-actions-dev:trip-assistant-lambda-deploy-dev]
module.api_gateway.aws_lambda_permission.api_gateway: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api_gateway.aws_apigatewayv2_integration.lambda: Refreshing state... [id=axdty2l]
module.api_gateway.aws_apigatewayv2_route.default: Refreshing state... [id=9vf2v5v]
module.api_gateway.aws_apigatewayv2_route.health: Refreshing state... [id=hkktkfk]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cognito.aws_cognito_identity_provider.google will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
      ~ attribute_mapping = {
          - "username" = "sub" -> null
            # (2 unchanged elements hidden)
        }
        id                = "us-east-2_JjUEYijkz:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          ~ "client_id"                     = (sensitive value)
          ~ "client_secret"                 = (sensitive value)
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_cognito_user_pool_domain.main will be created
  + resource "aws_cognito_user_pool_domain" "main" {
      + aws_account_id                  = (known after apply)
      + cloudfront_distribution         = (known after apply)
      + cloudfront_distribution_arn     = (known after apply)
      + cloudfront_distribution_zone_id = (known after apply)
      + domain                          = "trip-assistant-auth-dev"
      + id                              = (known after apply)
      + managed_login_version           = (known after apply)
      + s3_bucket                       = (known after apply)
      + user_pool_id                    = "us-east-2_JjUEYijkz"
      + version                         = (known after apply)
    }

  # module.ssm.aws_ssm_parameter.openai_api_key will be updated in-place
  ~ resource "aws_ssm_parameter" "openai_api_key" {
        id              = "/trip-assistant/dev/openai-api-key"
      + insecure_value  = (known after apply)
        name            = "/trip-assistant/dev/openai-api-key"
        tags            = {
            "Environment" = "dev"
            "Project"     = "trip-assistant"
        }
      ~ value           = (sensitive value)
      ~ version         = 7 -> (known after apply)
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ cognito_user_pool_domain    = "trip-assistant-dev" -> "trip-assistant-auth-dev"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
*Triggered by @OsherKoren on `feature/infra`*